### Libraries :

In [1]:
import pandas as pd

##### Data Fetch and idea

In [2]:

flights_df=pd.read_csv("D:\\Flask_tutorial\\mytrip\\flight_data_BOM_BLR.csv")

In [3]:
flights_df.head()

,FlightName,FlightCode,DepartingTime,ArrivingTime,Duration,Price,DepartingCity,ArrivingCity
0,Air India,AI 621,3:55,5:50,01 h 55 m,"2,307",Mumbai,Delhi
1,AirAsia,I5 670,19:55,21:45,01 h 50 m,"2,773",Delhi,Bangalore
2,AirAsia,I5 2992,23:55,1:45,01 h 50 m,"2,773",Bangalore,Kolkata
3,IndiGo,6E 5388,21:30,23:15,01 h 45 m,"2,839",Chennai,Hyderabad
4,Akasa Air,QP 1103,0:45,2:20,01 h 35 m,"3,005",Hyderabad,Pune

In [4]:
flights_df.columns

Index(['FlightName', 'FlightCode', 'DepartingTime', 'ArrivingTime', 'Duration',
       'Price', 'DepartingCity', 'ArrivingCity'],
      dtype='object')

In [5]:
source="Mumbai"
destination="Bengaluru"

In [7]:
 results = flights_df[(flights_df["DepartingCity"].str.lower() == source.lower()) & 
                         (flights_df["ArrivingCity"].str.lower() == destination.lower())]

In [8]:
print(results)

   FlightName FlightCode DepartingCity DepartingTime ArrivingCity  \
0   Air India     AI 621        Mumbai         03:55    Bengaluru
1     AirAsia     I5 670        Mumbai         19:55    Bengaluru
2     AirAsia    I5 2992        Mumbai         23:55    Bengaluru
3      IndiGo    6E 5388        Mumbai         21:30    Bengaluru
4   Akasa Air    QP 1103        Mumbai         00:45    Bengaluru
5   Akasa Air    QP 1103        Mumbai         00:45    Bengaluru
6   Akasa Air    QP 1103        Mumbai         00:45    Bengaluru
7   Akasa Air    QP 1341        Mumbai         20:00    Bengaluru
8   Akasa Air    QP 1341        Mumbai         20:00    Bengaluru
9   Akasa Air    QP 1139        Mumbai         18:05    Bengaluru
10     IndiGo    6E 6953        Mumbai         00:50    Bengaluru
11  Akasa Air    QP 1306        Mumbai         19:00    Bengaluru
12     IndiGo    6E 5352        Mumbai         06:10    Bengaluru
13     IndiGo    6E 5382        Mumbai         12:30    Bengaluru
14     IndiGo    6E 5382        Mumbai         12:30    Bengaluru
15  Air India     AI 607        Mumbai         16:40    Bengaluru
16     IndiGo    6E 5069        Mumbai         11:15    Bengaluru
17     IndiGo    6E 5069        Mumbai         11:15    Bengaluru
18    Vistara     UK 849        Mumbai         17:30    Bengaluru
19     IndiGo    6E 5125        Mumbai         23:15    Bengaluru
20     IndiGo    6E 5125        Mumbai         23:15    Bengaluru
21  Akasa Air    QP 1110        Mumbai         09:25    Bengaluru
22    Vistara     UK 845        Mumbai         05:55    Bengaluru
23     IndiGo    6E 6293        Mumbai         07:45    Bengaluru
24    Vistara     UK 853        Mumbai         16:00    Bengaluru
25  Akasa Air    QP 1625        Mumbai         13:35    Bengaluru
26  Akasa Air    QP 1625        Mumbai         13:35    Bengaluru
27     IndiGo    6E 5294        Mumbai         14:45    Bengaluru
28  Air India     AI 641        Mumbai         18:55    Bengaluru
29    Vistara     UK 865        Mumbai         18:55    Bengaluru
30     IndiGo    6E 5221        Mumbai         16:45    Bengaluru
31     IndiGo    6E 5067        Mumbai         18:05    Bengaluru
32     IndiGo    6E 5067        Mumbai         18:05    Bengaluru
33     IndiGo    6E 5256        Mumbai         20:35    Bengaluru
34    Vistara     UK 857        Mumbai         21:30    Bengaluru
35     IndiGo    6E 2244        Mumbai         19:30    Bengaluru
36  Air India     AI 603        Mumbai         06:45    Bengaluru
37    Vistara     UK 863        Mumbai         09:05    Bengaluru
38    Vistara     UK 863        Mumbai         09:05    Bengaluru
39     IndiGo    6E 5296        Mumbai         07:00    Bengaluru
40     IndiGo    6E 5211        Mumbai         08:30    Bengaluru
41     IndiGo    6E 5212        Mumbai         09:50    Bengaluru
42    Vistara     UK 851        Mumbai         07:00    Bengaluru
43  Air India     AI 639        Mumbai         09:20    Bengaluru

        ArrivingTime   Duration   Price
0              05:50  01 h 55 m   2,307
1              21:45  01 h 50 m   2,773
2   01:45\r\n+ 1 DAY  01 h 50 m   2,773
3              23:15  01 h 45 m   2,839
4              02:20  01 h 35 m   3,005
5              02:20  01 h 35 m   3,005
6              02:20  01 h 35 m   3,005
7              21:35  01 h 35 m   3,005
8              21:35  01 h 35 m   3,005
9              19:40  01 h 35 m   3,053
10             02:40  01 h 50 m   3,219
11             20:35  01 h 35 m   3,283
12             07:50  01 h 40 m   3,420
13             14:15  01 h 45 m   3,420
14             14:15  01 h 45 m   3,420
15             18:25  01 h 45 m   3,578
16             13:00  01 h 45 m   3,650
17             13:00  01 h 45 m   3,650
18             19:15  01 h 45 m   4,075
19  00:50\r\n+ 1 DAY  01 h 35 m   4,100
20  00:50\r\n+ 1 DAY  01 h 35 m   4,100
21             11:05  01 h 40 m   4,300
22             07:45  01 h 50 m   4,436
23             09:30  01 h 45 m   4,600
24             17:45  01 h 45 m   4,600
25             15:10  01 h 35 m   5,039
26             15:10  01 h 35 m   5,039
27             16:40  01 h 55 m   5,540
28             20:25  01 h 30 m   5,783
29             20:55       02 h   5,966
30             18:35  01 h 50 m   6,450
31             19:55  01 h 50 m   6,450
32             19:55  01 h 50 m   6,450
33             22:05  01 h 30 m   6,450
34             23:15  01 h 45 m   6,911
35             21:15  01 h 45 m   7,701
36             08:40  01 h 55 m   9,458
37             10:50  01 h 45 m  11,521
38             10:50  01 h 45 m  11,521
39             08:40  01 h 40 m  13,801
40             10:25  01 h 55 m  13,801
41             11:35  01 h 45 m  13,801
42             08:50  01 h 50 m  14,183
43             11:10  01 h 50 m  17,018

In [6]:
hotel_df=pd.read_csv("D:\Flask_tutorial\mytrip\indian_hotel_bookings.csv")
hotel_df.head()

<>:1: SyntaxWarning: invalid escape sequence '\F'
<>:1: SyntaxWarning: invalid escape sequence '\F'
C:\Users\hetvi\AppData\Local\Temp\ipykernel_10504\1939650531.py:1: SyntaxWarning: invalid escape sequence '\F'
  hotel_df=pd.read_csv("D:\Flask_tutorial\mytrip\indian_hotel_bookings.csv")

  Arriving City         Hotel Name  Rating  Price per Night (INR) Hotel Type
0         Delhi         Taj Palace     5.0                  12000     Luxury
1        Mumbai         The Oberoi     4.9                  10000     Luxury
2     Bangalore   The Leela Palace     4.8                   9000   Business
3       Chennai    ITC Grand Chola     4.7                   8500     Luxury
4     Hyderabad  Trident Hyderabad     4.6                   7500   Business

In [7]:
hotel_df.columns

Index(['Arriving City', 'Hotel Name', 'Rating', 'Price per Night (INR)',
       'Hotel Type'],
      dtype='object')

#### The other datasets

can suggest the recommendation based on the seat_class to the customer.